app/controllers/urls_controller.rb

  def destroy
    @url.destroy
---
DELETE FROM "urls" WHERE "urls"."id" = ?  [["id", 2]]

  def set_url
    @url = Url.find(params[:id])
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]